app/controllers/school_classes_controller.rb

    def index
        @school_classes = SchoolClass.all
---
SELECT "school_classes".* FROM "school_classes"

    def create
        SchoolClass.create(params.require(:school_class))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Class 6"], ["room_number", 6], ["created_at", "2018-07-04 16:49:10.410209"], ["updated_at", "2018-07-04 16:49:10.410209"]]

    def update
        @school_class.update(params.require(:school_class))
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Class 7"], ["room_number", 7], ["updated_at", "2018-07-04 16:57:48.542596"], ["id", 12]]

    def set_school_class
      @school_class = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 2]]