app/controllers/students_controller.rb

    def create
        Student.create(params.require(:student))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "August"], ["last_name", "Giles"], ["created_at", "2018-07-01 19:58:34.529718"], ["updated_at", "2018-07-01 19:58:34.529718"]]

    def update
        @student.update(params.require(:student))
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-09-11 20:28:36.905637"], ["id", 1]]

    def set_student
      @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", nil]]